[
    {
        "name": "Goku",
        "id": "1",
        "raze": "Saiyan",
        "desc": "The main protagonist of Dragon Ball series. Goku is a Saiyan warrior who seeks to protect Earth from various threats while constantly striving to become stronger.",
        "universe": "7"
    },
    {
        "name": "Vegeta",
        "id": "2",
        "raze": "Saiyan",
        "desc": "The prince of the Saiyan race and rival to Goku. Vegeta is initially introduced as a villain but later becomes one of Earth's greatest defenders.",
        "universe": "7"
    },
    {
        "name": "Gohan",
        "id": "3",
        "raze": "Half-Saiyan",
        "desc": "The eldest son of Goku and Chi-Chi. Gohan is a powerful warrior who has saved the Earth multiple times, often surpassing his father's strength.",
        "universe": "7"
    },
    {
        "name": "Piccolo",
        "id": "4",
        "raze": "Namekian",
        "desc": "Originally a villain, Piccolo becomes one of Earth's greatest allies. He is the reincarnation of the evil King Piccolo and serves as a mentor to Gohan.",
        "universe": "7"
    },
    {
        "name": "Krillin",
        "id": "5",
        "raze": "Human",
        "desc": "One of Goku's closest friends and a skilled martial artist. Krillin is a key member of the Z Fighters and has fought alongside Goku in many battles.",
        "universe": "7"
    },
    {
        "name": "Tien",
        "id": "6",
        "raze": "Human",
        "desc": "A skilled martial artist and former student of Master Roshi. Tien is known for his powerful techniques, including the Tri-Beam.",
        "universe": "7"
    },
    {
        "name": "Yamcha",
        "id": "7",
        "raze": "Human",
        "desc": "A former desert bandit turned martial artist. Yamcha is known for his bravery and has fought alongside the Z Fighters in numerous battles.",
        "universe": "7"
    },
    {
        "name": "Chiaotzu",
        "id": "8",
        "raze": "Human",
        "desc": "A small, telekinetic warrior and lifelong friend of Tien. Chiaotzu possesses psychic abilities and has fought against many powerful foes.",
        "universe": "7"
    },
    {
        "name": "Goten",
        "id": "9",
        "raze": "Half-Saiyan",
        "desc": "The second son of Goku and Chi-Chi. Goten is a playful and energetic fighter who closely resembles his father in both appearance and abilities.",
        "universe": "7"
    },
    {
        "name": "Trunks",
        "id": "10",
        "raze": "Half-Saiyan",
        "desc": "The son of Vegeta and Bulma from the future timeline. Trunks is a skilled warrior who travels back in time to warn the Z Fighters of impending danger.",
        "universe": "7"
    },
    {
        "name": "Android 18",
        "id": "11",
        "raze": "Android",
        "desc": "A powerful cyborg created by Dr. Gero to serve his vendetta against Goku. Android 18 later joins the Z Fighters and forms a family with Krillin.",
        "universe": "7"
    },
    {
        "name": "Android 17",
        "id": "12",
        "raze": "Android",
        "desc": "The twin brother of Android 18 and another creation of Dr. Gero. Android 17 is a skilled fighter who protects wildlife on a secluded island.",
        "universe": "7"
    },
    {
        "name": "Frieza",
        "id": "13",
        "raze": "Frieza Race",
        "desc": "An intergalactic tyrant and one of the most powerful villains in the universe. Frieza is responsible for the destruction of Planet Vegeta and many other atrocities.",
        "universe": "7"
    },
    {
        "name": "Cell",
        "id": "14",
        "raze": "Bio-Android",
        "desc": "A bio-engineered creature created from the cells of the greatest warriors in the universe. Cell seeks perfection and poses a grave threat to Earth.",
        "universe": "7"
    },
    {
        "name": "Majin Buu",
        "id": "15",
        "raze": "Majin",
        "desc": "An ancient and malevolent being who was awakened by the wizard Babidi. Majin Buu possesses immense power and childlike innocence.",
        "universe": "7"
    },
    {
        "name": "Beerus",
        "id": "16",
        "raze": "God of Destruction",
        "desc": "The God of Destruction of Universe 7. Beerus maintains balance by destroying planets and is accompanied by his attendant, Whis.",
        "universe": "7"
    },
    {
        "name": "Whis",
        "id": "17",
        "raze": "Angel",
        "desc": "An angelic being and the attendant of Beerus. Whis is incredibly powerful and serves as both a mentor and caretaker to Beerus.",
        "universe": "7"
    },
    {
        "name": "Bulma",
        "id": "18",
        "raze": "Human",
        "desc": "A brilliant scientist and inventor, and one of the founding members of the Z Fighters. Bulma provides crucial technological support to her friends.",
        "universe": "7"
    },
    {
        "name": "Chi-Chi",
        "id": "19",
        "raze": "Human",
        "desc": "The wife of Goku and the mother of Gohan and Goten. Chi-Chi is a fierce and protective mother who wants the best for her family.",
        "universe": "7"
    },
    {
        "name": "Videl",
        "id": "20",
        "raze": "Human",
        "desc": "The daughter of Mr. Satan and the wife of Gohan. Videl is a skilled martial artist who fights for justice alongside her husband.",
        "universe": "7"
    },
    {
        "name": "Mr. Satan",
        "id": "21",
        "raze": "Human",
        "desc": "A famous martial artist and champion of the world. Mr. Satan is known for his exaggerated ego but is ultimately a good-hearted individual.",
        "universe": "7"
    },
    {
        "name": "Turtle",
        "id": "22",
        "raze": "Animal",
        "desc": "A talking sea turtle and lifelong friend of Master Roshi. Turtle has been a companion to the Z Fighters for many years.",
        "universe": "7"
    },
    {
        "name": "Master Roshi",
        "id": "23",
        "raze": "Human",
        "desc": "A wise and powerful martial artist known as the Turtle Hermit. Master Roshi is one of Earth's greatest fighters and mentors to Goku and Krillin.",
        "universe": "7"
    },
    {
        "name": "Yajirobe",
        "id": "24",
        "raze": "Human",
        "desc": "A reclusive warrior and ally of the Z Fighters. Yajirobe is known for his cowardice but has proven himself in battle when needed.",
        "universe": "7"
    },
    {
        "name": "Kami",
        "id": "25",
        "raze": "Namekian",
        "desc": "The Guardian of Earth and the Namekian counterpart to Piccolo. Kami is a wise and ancient being who watches over the planet.",
        "universe": "7"
    },
    {
        "name": "King Piccolo",
        "id": "26",
        "raze": "Namekian",
        "desc": "The evil counterpart of Kami and the original incarnation of Piccolo. King Piccolo seeks world domination and is responsible for great destruction.",
        "universe": "7"
    },
    {
        "name": "Raditz",
        "id": "27",
        "raze": "Saiyan",
        "desc": "The older brother of Goku and a low-class warrior of the Saiyan race. Raditz comes to Earth to recruit Goku but ends up clashing with him.",
        "universe": "7"
    },
    {
        "name": "Nappa",
        "id": "28",
        "raze": "Saiyan",
        "desc": "A Saiyan warrior and former general of the Saiyan Army. Nappa accompanies Vegeta to Earth in search of the Dragon Balls.",
        "universe": "7"
    },
    {
        "name": "Ginyu",
        "id": "29",
        "raze": "Unknown",
        "desc": "The captain of the Ginyu Force, an elite squad of mercenaries in Frieza's army. Ginyu is known for his ability to switch bodies.",
        "universe": "7"
    },
    {
        "name": "Recoome",
        "id": "30",
        "raze": "Unknown",
        "desc": "A member of the Ginyu Force known for his immense strength and flamboyant personality. Recoome is one of Frieza's most loyal soldiers.",
        "universe": "7"
    },
    {
        "name": "Burter",
        "id": "31",
        "raze": "Unknown",
        "desc": "A member of the Ginyu Force known for his incredible speed. Burter considers himself the fastest being in the universe.",
        "universe": "7"
    },
    {
        "name": "Jeice",
        "id": "32",
        "raze": "Unknown",
        "desc": "A member of the Ginyu Force known for his powerful energy attacks. Jeice is often seen alongside Burter during battles.",
        "universe": "7"
    },
    {
        "name": "Guldo",
        "id": "33",
        "raze": "Unknown",
        "desc": "A member of the Ginyu Force with psychic abilities. Guldo uses his telekinesis to immobilize his opponents in battle.",
        "universe": "7"
    },
    {
        "name": "Dende",
        "id": "34",
        "raze": "Namekian",
        "desc": "A young Namekian who becomes the new Guardian of Earth after Kami. Dende possesses great healing abilities and a strong connection to nature.",
        "universe": "7"
    },
    {
        "name": "Mr. Popo",
        "id": "35",
        "raze": "Unknown",
        "desc": "An enigmatic character who serves as the assistant to Kami. Mr. Popo is responsible for maintaining the lookout and training the Z Fighters.",
        "universe": "7"
    },
    {
        "name": "Shenron",
        "id": "36",
        "raze": "Dragon",
        "desc": "The Eternal Dragon summoned by the Dragon Balls. Shenron has the power to grant any wish within his creator's power.",
        "universe": "7"
    },
    {
        "name": "Broly",
        "id": "37",
        "raze": "Saiyan",
        "desc": "The Legendary Super Saiyan with immense power. Broly is known for his uncontrollable rage and desire for vengeance against Goku.",
        "universe": "7"
    },
    {
        "name": "Bardock",
        "id": "38",
        "raze": "Saiyan",
        "desc": "The father of Goku and Raditz and a low-class warrior of the Saiyan race. Bardock is known for defying Frieza's orders and standing up against tyranny.",
        "universe": "7"
    },
    {
        "name": "Caulifla",
        "id": "39",
        "raze": "Saiyan",
        "desc": "A powerful Saiyan from Universe 6 and leader of the Saiyan gang. Caulifla possesses immense potential and quickly masters Super Saiyan transformations.",
        "universe": "6"
    },
    {
        "name": "Kale",
        "id": "40",
        "raze": "Saiyan",
        "desc": "A timid but immensely powerful Saiyan from Universe 6. Kale is Caulifla's protégé and possesses a unique berserker form.",
        "universe": "6"
    },
    {
        "name": "Hit",
        "id": "41",
        "raze": "Assassin",
        "desc": "The legendary assassin from Universe 6 known as the 'Legendary Hitman.' Hit is known for his time-skipping ability and stoic demeanor.",
        "universe": "6"
    },
    {
        "name": "Cabba",
        "id": "42",
        "raze": "Saiyan",
        "desc": "A Saiyan warrior from Universe 6 and protege of Vegeta. Cabba is a noble fighter who seeks to protect his universe from threats.",
        "universe": "6"
    }
]
